export const Tags = [
    {
        id:1,
        tag:'Подарочная упаковка'
    },
    {
        id:2,
        tag:'Букеты',
    },
    {
        id:3,
        tag:'8 марта',
    },
    {
        id:4,
        tag:'14 февраля',
    },
    {
        id:5,
        tag:'Цветы',
    },
    {
        id:6,
        tag:'Букеты из конфет',
    },
    {
        id:7,
        tag:'Букеты из фруктов',
    },
    {
        id:8,
        tag:'Цветы в корзине',
    },
    {
        id:9,
        tag:'Мужские букеты',
    },
    {
        id:10,
        tag:'Пасха',
    },
]

